"""
если бутстрап, то контейнер
если адаптивный, то каждый див класс будет роу

хэдер на БС обрамляется див-класс-ровом

как сделать футер:
див-класс-роу:
    футер класс... бг-саксес текст=вайт текст-центер 'py-3'
        <п>&copy; 2025; Компания "Светофор"</п>
всегда есь контейнер, высший это окно браузера,
    'py-3' значит по игреку паддинг в текущем контейнере

через две недели хотел бы увидеть у нас три страницы на бутстрапе

можно карусель (подключить js правильный)

индекс, эбаут и контактс — вот и вся работа


Что такое джава-скрипт, и как его подключить к вашей странице?
наверху страницы

Что же мы будем делать в дипломе? Три страницы. Динамичные?
Не псевдодинамичные, как сегодня.
Это когда по запросу пользователя подгружается с БД.


"""