"""
Легаси — это код, написанный когда-то, когда все так писали и продолжают писать,
хотя теперь так не пишут. Деприкэйтыд — это функционал, который поддерживается
в новой версии, но не рекомендуется впредь. То есть по возможности следует его
избегать в новом коде.
<kvgxgelbkjmyomem>

есть сервис Паст-АПИ
и кодэпэн
https://epasstoken.com/5-solutions-to-fix-jinja2-exceptions-templatesyntaxerror-expected-token-got-and-avoid-future-errors-expert-tips/


итак, что такое SAS
отроем проект.
vscode
Live Sass Compiler
препроцессор, типа метаязыка такого
ещё есть
LESS

xTunnel.ru - это сайт, надо посмотреть
ДЗ создать своего бота через фазера, токен надо будет завтра

что мы не успели рассмотреть:
- джанго
- ВК-бот
- рестфул Фласк

в последнем коммите добавлена ссылка на джаваскрипт-бутстрап

ещё надо научиться цеплять к апи-запросу токен безопасности

в Джанге через командную строку чаще

БУДЕМ на ГИТВЁРСЕ размещаться! единственно что пока что гитить надо будет через командную строку, но и это круто)



"""
from mailsender import send_mail



